base_setup/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1041.263 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1041.263 0 0);
    }
    ogive
    {
        type           slip;
    }
    bearing
    {
        type           slip;
    }  
    boat
    {
        type           slip;
    }  
    base
    {
        type           slip;
    }
    front
    {
        type           wedge;
    }
    back
    {
        type           wedge;
    }    
    top
    {
        type            zeroGradient;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (1041.263 0 0);
        value           uniform (1041.263 0 0);
    }
}


// ************************************************************************* //
