base_setup/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    UFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    "p.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.0;
    }

/*
    "p.*"
    {
        solver           GAMG;
        tolerance        1e-8;
        //relTol           0.01;
        relTol           0.0;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        //nCellsInCoarsestLevel 100;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
*/

    "e.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.0;
    }

    "rho.*"
    {
        solver          diagonal;
    }

    "(k|epsilon|omega|h).*"
    {
        //$p;
        //tolerance       1e-8;

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

}

PIMPLE
{

    momentumPredictor 	yes;
    consistent 		yes; 

    nOuterCorrectors     5;
    nCorrectors          2;
    nNonOrthogonalCorrectors 1;

    transonic 	yes;

//more option in
//finiteVolume/cfdTools/general/solutionControl/solutionControl/fluidSolutionControl

}

relaxationFactors
{
    fields
    {
        ".*"   0.9;  // ensure diagonal equality
    }
    equations
    {
        ".*"   0.9;  // ensure diagonal equality
    }
}

// ************************************************************************* //
